---
title: DataTransferProgressChangedEventArgs
classe: Autodesk.Revit.DB.Events.DataTransferProgressChangedEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.WorksharedOperationProgressChangedEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# DataTransferProgressChangedEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double FinishedSize { get; }` | `dataTransferProgressChangedEventArgs.FinishedSize` | Double |
| `Double Speed { get; }` | `dataTransferProgressChangedEventArgs.Speed` | Double |
| `Double TotalSize { get; }` | `dataTransferProgressChangedEventArgs.TotalSize` | Double |
| `DataTransferMode TransferMode { get; }` | `dataTransferProgressChangedEventArgs.TransferMode` | DataTransferMode |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```